from ibm_watsonx_ai.foundation_models import Model
import os

class ALLaM_Recognizer:
    @staticmethod
    def get_credentials():
        return {
            "url": "https://eu-de.ml.cloud.ibm.com",
            "api_key": "RGFpLsHNJvfKImXgyKACDUWgAmj9A8e62cSLS5cgP17u"
        }

    model_id= "sdaia/allam-1-13b-instruct"
    project_id= "b04555df-6516-4591-9826-2e7bf07168db"

    parameters= {
        "decoding_method": "greedy",
        "max_new_tokens": 820,
        "repetition_penalty": 1.23
    }

    space_id= os.getenv("SPACE_ID")

    model = Model(
        model_id= model_id,
        credentials= get_credentials(),
        params= parameters,
        project_id= project_id,
        space_id= space_id
    )

    @staticmethod
    def process_text(extracted_text):
        #Preparing the prompt for the model.
        prompt_template= """سيتم تزويدك بنص تم استخراجه من صورة، يجب عليك تصحيح النص من الأخطاء الإملائية والنحوية، ثم يجب عليك وضع العلامات الإعرابية على النص كامل والتحقق من النص بأنه مطابق للنص الذي تم تزويدك به بدون زيادة على محتوى النص.

        تأكد من التالي بدقة شديدة:
        اكمل الكلمات او العبادات اللازمة. على سبيل المثال: إذا ذكر صحابي أو رسول قم بإكمالهم كالتالي: الرسول صلى الله عليه وسلم٬وأما الصحابي فأكمله كالتالي: ابو هريرة رضي الله عنه.
        
        Input:  لا أحب الحياة الجديده ولا مظاهرها ولا بيوتها ولا
        ساكنيها أريد ذالك البيت الصغير والحارة الصغيرة
        التى لا تتسابق فيهاالطوابق تعلو بعضها الآخر أريد
        تللكت الأرجوحة الزرقاء التي كانت وطن لضحكاتنا أريد

        إنتظار العيد بالحناء والغناء أريد تلكالفرحة اللتي

        تستقبل المطر أريدنا نحن متجردون من كل هذه
        التكاليف اريدنا ان نعود إلى الزمان حيث لا جدران تفصلنا ولاأبواب توصدنا
        Output: لَا أَحُبَّ الْحَيَاةِ الْجَدِيدَةِ وَلَا مَظَاهِرُهَا وَلَا بُيُوتُهَا وَلَا سَاكِنِيهَا. أُرِيدُ ذَلِكَ الْبَيْتِ الصَّغِيرِ وَالْحَارَّةِ الصَّغِيرَةِ الَّتِي لَا تَتَسَابَقْ فِيهَا الطَّوَابِقَ تَعْلُو بَعْضُهَا الْآخِرَ. أُرِيدُ تِلْكَ الْأُرْجُوحَةِ الزَّرْقَاءِ الَّتِي كانت وَطَنٌ لِضَحْكَاتِنَا. أُرِيدُ إنتظار الْعِيدَ بِالْحِنَّاءِ وَالْغِنَاءِ. أُرِيدُ تِلْكَ الْفَرَحَةِ الَّتِي تَسْتَقْبِلُ الْمَطَرُ. أُرِيدُنَا نَحْنُ مُتَجَرِّدُونَ مِنْ كل هَذِهِ التَّكَاليفَ. أُرِيدُنَا أَنَّ نَعُودُ إِلَى الزَّمَانِ حَيْثُ لَا جُدْرَانُ تَفَصُّلِنَا ولا أبواب تُوصِدُنَا.

        Input: السلام عليكم ورحمة الله وبركاته
        Output: السُّلَّامُ عَلَيْكُمْ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ.

        Input: قام الملك عبد العزيز بعمل بطولي من أجل استرداد ملك أبائه وأجداده الذي سلبه الأعداء من الخارج والداخل؛ ونجح في استرداد
        مدينة الرياض عاصمة الدولة السعودية الثانية في قلة قليلة من العدة والعتاد.
        Output: قَامَ الْمَلِكُ عَبْدُ الْعَزِيزِ بِعَمَلٍ بَطُولِيٍّ مِنْ أَجْل اسْتِرْدَادِ مَمْلَكَةِ آبَائِهِ وَأَجْدَادِهِ الّتِي سَلَبَهَا الْأَعْدَاءُ مِنَ الْخَارِجِ وَالْدَّاخِلِ؛ وَنَجَحَ فِي اسْتِرْدَادِ مَدِينَةِ الرَّيَاضِ عَاصِمَةِ الدَّوْلَةِ السَّعُودِيَّةِ الثَّانِيةِ فِي قِلَّةِ قَلِيلَةٍ مِنَ الْعُدَّةِ وَالعَتَادِ.
        Input: وسطّر في التاريخ أروع مثل في التضحية من أجل الوطن
        وترابه مُعرّضاً نفسه للمخاطر التي كانت تتربص به من قبل أعدائه؛ وتمكن بعد ذلك من استكمال مشروعه الوطني في توحيد واخضاع
        مناطق شبه الجزيرة العربية (نجد- القصيم- الإحساء- جبل شمر عسير الحجاز- المخلاف السليماني «جازان») والتي دانت له جميعها
        بالسمع والطاعة.
        Output: وَسَطَّرَ فِي التَّارِيخِ أَرْوَعْ مَثَلٍ فِي التَّضْحِيَةِ مِنْ أَجْلِ الْوَطَن وَتُرَابِهِ مُعَرِّضًا نَفْسَهُ لِلْمَخَاطِرِ التي كَانَتْ تَتَرَبَّصُ بِهِ مِنْ قِبْلِ أَعْدائِه؛ وَمَكَّنَ بَعْدَ ذَلِكَ مِنْ اسْتِكْمَالِ مشْرُوعهِ الْوَطَنِيِّ فِي تَوْحِيدِ وَإخْضَاعِ مَنَاطِقِ شِبْهِ الْجَزِيرَةِ الْعَرَبِيَّةِ (نَجْد- الْقَصِيمِ- الْإِحْسَاءِ- جَبَلِ شَمَّرَ- عَسِيرَ- الْحِجَازِ- الْمَخْلَافِ السُّلَيْمَانِيِّ «جَازَانَ») وَالَّتِي دَانَتْ لَهُ جَمِيعُهَا
        بِالْسَمْعِ وَالطَاعَةِ.

        Input: 1797ه/1611م
        Output: 1797هـ/1611م

        Input: عمل علي بناء
        Output: عَمِلَ عَلَى بِنَاءِ.

        Input:  إال أنهــا تركــت يي البالد النجديــة
        Output: إِلَّا أَنَّهَا تَرَكَتْ في البلاد النَّجْدِيَّةِ.

        Input: نمذاج علام ااالمهتص يي النصوص العربيه
        Output: نَمُوذَجُ عَلَّام المختص فِي النَّصُوصِ الْعَرَبِيَّةِ.

        Input: فرثق منييره ومهند يي ت حدي علام
        Output: فَرِيقُ مُنِيرَه وَمُهَنَّدٍ فِي تَحُدِّي عُلَّامَ.

        Input: ااالذي
        Output: الَّذِي

        Input: مااااههر
        Output: مَاهِرٌ

        Input: سييتي
        Output: سَيَأْتِي

        Input: السيياااح  ه
        Output: السِّيَاحَةُ

        Input: هل هل يمكن لنموذج عل#ام تدرىب الصور؟
        Output: هَلْ يُمْكِنُ لِنَمُوذَجِ عَلَّامٍ تَدْرِيبُ الصُّوَرِ؟

        Input: م هة عمر السف
        Output: مَنْ هُوَ عُمَرُ السَّيْفُ؟

        Input: قا الحاف ظ ابنن القم رحم الله تعالى في اذكر النوم
        Output: قَالَ الْحَافِظُ ابْنُ الْقَيِّمِ رَحِمَهُ اللَّهُ تَعَالَى فِي أَذْكَارِ النَّوْمِ:

        Input: عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:
        Output: عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:
        
        Input: في السنة أربعة فصول صيف وخريف وشتاء وربيع
        Output: فِي السَّنَةِ أَرْبَعَةَ فُصُولٍ: صَيْفٌ، وَخَرِيفٌ، وَشِتَاءً، وَرَبِيعٌ.
                
        Input: يا محمدادرس بجد
        Output: يَا مُحَمَّدُ، اُدْرُسْ بِجِدٍّ.
                        
        Input: بلا اللغة الععربية ممتعة..
        Output: بَلَا، اللُّغَةَ الْعَرَبِيَّةَ مُمْتِعَةٌ.
                        
        Input: خالد طالب ذكي يدرس بج د ويساعد زملاءه ولا يؤذي أحداً
        Output: خَالِدُ طَالِبُ ذَكِيُّ، يَدْرُسُ بِجِدٍّ، وَيُسَاعِدُ زُمَلَاءَهُ، وَلَا يُؤْذِي أحَدَا
                        
        Input: كان   هذا الطالب مجتهدًا طوال العام ولذلك نجح متفوّقًااا
        Output: كَانَ هَذَا الطَّالِبُ مُجْتَهِدًا طُوَّالَ الْعَامِ ؛ وَلِذَلِكَ نَجُحْ مُتَفَوِّقًا.
                        
        Input: أحب القراءة كرة السلة الشطرنج
        Output: أَحُبُّ الْقِرَاءةِ، وكُرَةَ السَّلَّةِ، والشِّطْرَنْجَ.
                        
        Input: من يعمل بجد يحصد الجزاء
        Output: مَنْ يَعْمَلُ بِجِدٍّ، يَحْصُدُ الْجَزَاءُ.
                        
        Input: والله لأجتهد لأحقق حلمي
        Output: وَاللهُ، لِأَجْتَهِدُ لِأُحَقِّقُ حُلْمَي.
                        
        Input: ١ فاصلة ٢ نقطة
        Output: ١- فَاصِلَةٌ ٢- نُقْطَةٌ
                        
        Input: حلصت منى على جاىزه التفوق لانها اجتهدت طوال السنة
        Output: حَصَلَتْ مِنَى عَلَى جَائِزَةِ التَّفَوُّقِ؛ لِأَنَّهَا اجْتَهَدَتْ طُوَّالَ السَّنَةِ.
                        
        Input: وفي صحيح مسلم عن أبي هريرة
        Output: وَفِي صَحِيحِ مُسْلِمٍ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ
        
        Input: رَبَّا وَرَبَّ كُلِّ شَيْءٍ
        Output: رَبَّنا وَرَبَّ كُلِّ شَيْءٍ
        
        Input: {extracted_text}
        Output:"""

        formatted_question= prompt_template.format(extracted_text= extracted_text)
        prompt= f"{formatted_question}"

        #Generating the response from the model.
        generated_response= "Output: "
        generated_response+= ALLaM_Recognizer.model.generate_text(prompt= prompt, guardrails= False)

        lines= generated_response.splitlines()
        result= [line for line in lines if line.startswith("Output:")]

        if result:
            extracted= result[0].split("Output: ")[1].strip()
            
        return extracted
    
    @staticmethod
    def correct_arabic_text_file(input_file, output_file):
        # Read the Arabic text from the input file
        with open(input_file, "r", encoding= "utf-8") as file:
            extracted_text= file.read()
        # Process the text in smaller segments for improved accuracy
        corrected_text= "\n".join(ALLaM_Recognizer.process_text(segment) for segment in extracted_text.splitlines() if segment.strip())

        # Write the corrected text to the output file
        with open(output_file, "w", encoding= "utf-8") as file:
            file.write(corrected_text)

        print(f"Corrected text has been written to {output_file}")  # Confirmation message

if __name__ == "__main__":
    input_file= "Website/TemporaryDatabase/arabic_text.txt"  #Path to Reading the Arabic text from arabic_text.txt document.
    output_file= "Website/TemporaryDatabase/corrected_text.txt"  #Path to save the corrected text in corrected_text.txt document.

    ALLaM_Recognizer.correct_arabic_text_file(input_file, output_file)